In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'A':[1,2,3],'B':[10,20,30]})
df2 = pd.DataFrame({'A':[4,5,6],'B':[40,50,60]})

In [3]:
df1

   A   B
0  1  10
1  2  20
2  3  30

In [4]:
df2

   A   B
0  4  40
1  5  50
2  6  60

In [5]:
df1.append(df2)

   A   B
0  1  10
1  2  20
2  3  30
0  4  40
1  5  50
2  6  60

In [6]:
df3 = pd.DataFrame({'C':[4,5],'B':[40,50]})
df3

   C   B
0  4  40
1  5  50

In [7]:
df1.append(df3)

     A   B    C
0  1.0  10  NaN
1  2.0  20  NaN
2  3.0  30  NaN
0  NaN  40  4.0
1  NaN  50  5.0

In [8]:
df1.append(df3)

     A   B    C
0  1.0  10  NaN
1  2.0  20  NaN
2  3.0  30  NaN
0  NaN  40  4.0
1  NaN  50  5.0

In [10]:
pd.__version__

'1.1.3'